{"podcast_details": {"podcast_title": "HCM Technology Report", "episode_title": "isolved's Geoff Webb on AI and the HR Tech of Small Business", "episode_image": "https://megaphone.imgix.net/podcasts/88f2e57a-13e7-11eb-922a-23814e3e7384/image/headphones.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " This is PeopleTech, the podcast of the HCM Technology Report. I'm Mark Pfeffer. Today I'm speaking with Jeff Webb, the Vice President of Solutions Strategy at iSolve. The company recently launched Compensation Analytics and Talent Intelligence Solutions, both as a follow-up to their benchmark insights. The products are designed to help companies of all sizes take advantage of enterprise-grade analytics. We're going to talk about the technology needs and demands of small business and look at what AI means to them. We'll also talk about how vendors are trying to address those needs on this edition of PeopleTech. Hey Jeff, welcome. Now iSolve recently said that it plans to incorporate new tools into PeopleCloud and their aim is to help small and medium-sized businesses. I'm curious about what those tools do and what's the thinking behind adding them. Oh yeah, sure. So, I mean, obviously we provide both technology and we provide a lot of services as well and advice and things. But from the technology point of view, you know, we're always moving forward the capabilities of the platform because the demands and the needs of our customers and our partners continue to evolve too, as and are driven by the demands and needs of their employees and the businesses that they serve. And so for us, we've been looking at how do we reduce workload, how do we make it easier to find and keep good people, how do we provide better information to HR teams and business leaders to make good decisions. So we're including a lot of capabilities and I hesitate to use the phrase artificial intelligence, but we are going to genuinely, it has its uses and we can certainly talk about what we mean by those things. But there's a lot more intelligence in the platform and especially in the roadmap moving forward, we're continuing to develop intelligence in the platform for very good reasons, better analytics and just more capacity to automate and simplify the sort of the workflows. But if you think about the objective here, a lot of the things we're building out are let's just make it easier for HR people to focus on what they care about and let's make it easier for them to make good decisions and feed good decision, supporting information and data into business leaders so that they can make good decisions about how they develop their organization and what is the future shape of their business going to look like. When you say you're adding more intelligence to the platform, what do you mean by that? What kind of thing is it going to be able to do now? So I think if I think about the way that we are seeing the sort of the whole role of machine learning and artificial intelligence emerging in HR technology, I tend to think of it in sort of three buckets, three sort of groups of capabilities. And we're really addressing all three at various points, both recently and over the course of the next few months and through into next year. I would say first and foremost, the sort of the AI engine in the background, there's things in the flow of work where artificial intelligence can be used to better identify trends. It can be used to simplify work. It can be used to spot anomalies. So I'm thinking of a good example here. There's a sudden change in your payroll in some area that looks weird. Maybe there's been a mistake made. Maybe there's, you know, heaven forbid, fraud or something else going on. It's the kind of thing that might get missed by very, very busy people. It's a perfect kind of use case for something like an AI or, you know, basically a machine learning model to go, well, hold on. Normally it would look like this. That's a weird anomaly. You should probably go look at that. So I mean, that's the sort of one area. So in the flow of work, doing things in the background to simplify and streamline and to help run things. I think the second area is really around the use of AI to provide more personalization and more intelligence into the sort of interactions with people. So things like learning what questions get asked regularly, enabling people to more easily find information that they want, personalizing and identifying, you know, you're here in your job. The next things that we would normally expect you to go learn how to do with this, this and this. You should probably take these courses. So that sort of personalization engine that we were very comfortable with in a lot of places in our sort of day to day lives, starts to feed into work. And then I think the third area is interaction. So you've got a sort of an engine running things. You've got some personalization and tuning capabilities. And then you've got an interaction engine capability that, you know, things like chat bots, for example, a great example of that, that make it very, very easy for people to self serve and just find stuff. Tell me how many days vacation I have. Is this a holiday? Who's on my benefit? You know, who are my benefit recipients? How do I do this? Where would I find that information? And that just moves those, you know, hesitate to say, but very transactional conversations away from an HR professional who's trying to get other stuff done and but answers the same questions over and over again. It moves it to an automated process. It actually is much more, can be much more responsive and can learn in the sort of the interactions too. So you've really got those three and we're really looking at all three of those as areas where we can just continue to build and infuse the platform with more intelligence as we go along. These are all great examples of how small business software for HR is getting more powerful, which usually means it's getting more complex. Given the dynamics of SMBs, are business owners and managers able to keep up with all this in understanding it, if not using it? Yeah, I think that's, you kind of hit the nail on the head right there, which is the trick here is to, is not just to sort of put tools out there. It's not just to throw technology at problems. It's not just to give more, you know, bloat technology platforms with more and more capabilities. The trick here is to embed them in a way that makes them not just useful but really, to a degree, almost built into the fabric of the workflow. I know that sounds really jargony but it's basically the idea is look, we don't want to have people to deal with AI. They shouldn't have to. I don't think about dealing with AI when I'm asking my phone to go find me the closest, you know, quickest route to the pizza store. I have a problem. I want some help with it. Go, some technology can help me go find that. So, the approach should always be how do we embed more intelligence into tools to make the tool easier to use, and to make the tool able to deliver more value and more capabilities, not add additional buttons to push and levers to pull, so that people become more intelligent and actually start to shy away from it. And the good news is, you know, what we're seeing overall is in the industry is there is there's a good move to embedding more intelligence in these tools in a way that is easier to consume for people that just don't have the time to spend, you know, figuring out and tinkering under the hood, but it is a it's a, it's a dangerous path to go down to start to think well we'll just make it smarter and smarter and smarter and it becomes more intelligent and harder to use. And that's not the job at all. You've actually just teed up my next question, because I'm, I'm always wondering about, you know, users employers and employees. Do they really care if something is AI or they really thinking about what can I do with this product or what can I do with that tool. I think it's exactly right, and it shouldn't matter to them. I mean, the point should be that, you know, and actually say this I talked to a lot of our, you know, our HR customers and our partners, and I tend to frame up the, the importance of AI in these technologies is really this, it is looking on one hand, it can help answer questions for you so in other words if I have a question, the tool the technology can help me go find the answer more easily and more quickly and that that's something that they care about. But I think the thing that really separates where we're headed with this technology from other approaches from just sort of raw automation is that AI can not only help you answer. The question more easily, but it can help you identify the questions that you should be asking yourself. In other words, again go back to that example, I've seen a change occurring here that looks a little odd, you should probably look at that and understand why because it looks like it's sort of out of bounds or something odd going on here. Take a closer look you've suddenly changed your, your hiring practices you've suddenly changed how much you're spending to bring these people in you're suddenly seeing a change in the diversity of this particular department and it's in a weird way maybe take a look at that. And that they do care about. They care about getting to focus on the things that are important to them, whether that's again, you know, attention or quality or, you know, higher productivity or whatever it happens to be generally building a good employee experience. Those things they care about the how you get there is, and should remain essentially relevant to them that's our job as a technology provider and support of these organizations to figure out how to infuse the tools they use with more intelligence to make them easier to use I don't care about how my engine, the engine in my car manages its fuel efficiency. I just want to make sure that when I press the accelerator it goes in a good way and that's really how we should be thinking of this technology. Technology should be getting easier to use, not, not more difficult, but if it's getting more sophisticated that's a good thing. What's the game where no one wins the waiting game. When it comes to hiring, don't wait for great talent to find you find them first with Indeed. Indeed is the hiring platform where you can attract interview and hire all in one place with instant match over 80% of employers get quality candidates whose resume on Indeed matches their job description. The moment they sponsor a job and Indeed does the hard work for you. It shows you candidates whose resumes fit your description immediately after you post so you can hire faster. So join more than 3 million businesses worldwide that use Indeed to hire great talent fast. Start hiring now with a $75 sponsored job credit to upgrade your job post at Indeed.com slash HCM. The offer is good for a limited time. One more thing in the minute I've been talking to you 16 hires were made on Indeed. You know, you mentioned a few minutes ago you were talking about the flow of work and I know that there's details about your approach to the flow of work in your roadmap. And it's other vendors are also talking about the flow of work. I mean, it's, you know, it's what people are paying attention to. So, if users are accessing tools through let's say, kind of a satellite, lack of a better word satellite apps or, you know, things directly packaged in with with I saw. What's that mean for your product and your product design. I think a couple of things I would say from a, from a design perspective, you have to have a great degree of consistency in the way you interact, and you have to make them. You have to build in from a design perspective, simplicity and ease of interaction. So I think, you know, I think of examples of we have customers who would have, you know, they don't have a whole bunch of people sitting in offices, necessarily on a PC or on a you know on a laptop or something chugging away doing things. They tend to have people out on the road they have people on construction sites you know they have a nursing staff or driving around between different locations. They want to be able to very easily get access to information, do things they want to be able to do it at the weekend when they're not necessarily there's nobody back in the home office. They want to do it from a mobile phone, that might be, you know, several generations out of date like mine. And, and so you have to make it so that there's the great degree of consistency and accessibility to everything that you build and so you have to start from that perspective, which is what's the right approach, we know we took a design decision to not build things like a dedicated mobile app, simply because it, they know they always left behind they're always like, they're always harder to maintain and they're always harder interface to deal with. So we built, you know, without getting into too much of the technology details. The approach we built was using what's called a progressive web app which again I won't go any more technical than that but it's the objective here is that the way it's delivered is completely consistent across every platform and by the way other companies are looking at this too it's not that we're the only people who've spotted this as an approach but that's always been our approach. And so, it what it means is, you get comfortable using the technology, so you can self serve, which means that it's always available always consistent there's a lot less work for everybody involved. And so you build that in to the way you design the interface, and then you layer on top of that. And then the things we were talking about just now around greater intelligence interaction chat bots natural language processing so that in other words, you know the objective here is I don't have to even as easy as it is navigate through to some menu to say tell me, you know how to do this, I can literally just ask the system and the system understands enough of human interaction and language to be able to go get me the answer that I need. And even more importantly, take the next step which is say okay you asked a great example you asked how many vacation days, you have left or how many hours you have left this month. Here you are. Does that mean you'd like to book a vacation day if so let me know, and I'll run that system and go automate the steps in the background, you know, I'll, I'll pass from the, the interaction layer back to the engine in the background, I'll go do that for you, let your boss know, tell them when they've said yes, I'll let you know and you're good to go all the records are up today. That's building intelligence both into the interaction, but also into the core flow of work so that everything just comes much more intuitive and natural in the way that we interact with technology. And then there's something else in your roadmap that caught my eye. You talks about zero error payroll. Yeah. And my first reaction was really. But can you talk about your thinking there. Yeah, it's an objective right i mean, I think one of the first things we see you know we we've, when we start working with organizations, we often will look at we have a what we call a maturity model the HM maturity model, and that model is it really lays out the, the journey that many of many organizations have already been through, you know, we've been doing this for a long time. And as a result we've seen that that sort of journey occur very often. And so we have a model that enables us to have a common frame of reference a conversation with, you know, with an organization that we're engaged in with to say well okay, we see your, you're kind of here, this is the things that we see happen here's the stuff you're saying you're seeing in your organization. That means you're probably here, which means that the next set of steps should be this this and this. And the first places we find is that people say payroll is so painful right it's so difficult to do it's extremely manual process. We often have issues with just getting accurate information on time we're constantly having to go back and fix things. We know that there are studies out there that show that even minor errors in your payroll accumulate very rapidly to cost businesses, lots and lots of money both in time to fix it, but actually in things like overpaying people. And so it's a scenario that we usually see first of all on that that sort of journey of help me reduce the workload of running payroll and getting it right because errors cost time and money and just nobody's happy right nobody's happy if they're underpaid the business, not happy for overpaid and the HR payroll people are not happy in other situation they'd like to get it done. So what we're talking about here is well, obviously the first step we typically put in place is the automation of that process is automate payroll just makes it easier. But in addition, that sort of that back end engine that that thing that's running is capable and I'm saying well, the objective here is to say well, again, I see a weird anomaly in your payroll from a business perspective. In other words, you're running payroll something's happened, go check because I think an error was made there something went wrong, or alternatively, from the perspective of the employee to be able to alert them to say, by the way, your payroll just weirdly change this month. Is that nor were you expecting that change because you should probably check in on that. And both of those do a couple of things both of them, obviously, give you more confidence that things are running correctly they're going to reduce errors they're going to reduce cost, but they also improve the experience of people they prove the experience of poor HR payroll people who are trying to run stuff and get it right. And they improved the experience of the employee enormously, because now I'm looking at this going hey there's somebody actually checking my my payslip for me making sure I got paid the right number of hours for the right overtime and for the right time. And that gives me more confidence that these guys are on my side. So, zero error, you know payroll perfect payroll, however we're tracing it. That's the objective here and the way you get there is you you infuse machine learning and artificial intelligence into the process to just keep an eye on stuff and it's the thing that is really good at. You know expanding your AI ethics policy. And I think you were one of the first companies to have. But what are you adding to it or changing and what spurred you to do it. Yeah, you know, I think that having a strong AI ethics policy is really really important it is, it's part of the, the, you know the sort of almost like the social contract between ourselves and our customers and our employees and our customers and the broader broader society we handle an enormous amount of sensitive information for our customers for our partners. It's, you know, we're talking about touching the lives of presence of business what's over 6 million employees around the US now, who's very sensitive information is with us. We want to make sure a couple of things that one that we're very clear on how that information is used. In other words, we have to, we've entrusted with your with sensitive information we want to be very clear. This is how that information is used it's used in the ways you would expect and would want us to use it it's not used in other ways. And to, as we use intelligence and artificial intelligence to do more things to, you know, extract or identify information that's in there that you would want to know that is done so in a transparent and ethical way in other words we're not going to be looking at things we're not going to be doing things with information that is that you would not want us to be doing using that kind of technology. And then the third thing is, is that AI itself is not being used in an unethical way and this is what you reach this frontier very quickly there are things you can do with AI and there are so many examples where, you know, not having a strong ethical framework and a clear ethical policy and approach can lead you astray very very easily very quickly look down the sort of the, you know, the dark side of AI, and we don't want to do that we want to be very clear that this is approach for take it we live and breathe on the trust of our customers and our partners and broadly in the market overall, we need to maintain that being transparent about it's the best way. You've been talking a lot about very sophisticated products and very sophisticated technology. And I think most people, when they hear about products like this they think of large businesses and enterprise they don't think about small businesses. How do you view the overall landscape. And with that I mean when you think about the HR technology industry. Where does the small business market fit into the overall equation. Yeah, I love that because it's an area that I feel so very passionate about myself, which is that, you know, you talk to big businesses and they say look we struggle to compete with the with bigger organizations that can offer more benefits and can can, you know, attract away that are best employees we we have a small team. We need to get so many things done. One of the really great things about what's happening right now is that these kinds of technologies, HTM platforms like ours, you know the HTM platforms generally the infusion of things like artificial intelligence into the platforms and so on and so on. The automation capabilities the analytics capabilities all those things being built in in the right way. What what's happening is that the tools that only used to be available to large enterprises that have a big team are becoming very very accessible and very usable and really becoming tools that are right there in the toolbox of small to medium businesses. It's, it's no longer a case that you're having, they have to deal with sort of stitching together bits of technology and figuring things out and post it notes and Excel spreadsheets, that the level of capability is now very much available for small to medium business. And we have learned so many lessons about usability and ease of use and simplicity and elegance in the way that you use this technology from all the things that have happened at the enterprise layer where you saw these, you know, and I come from, I've worked at many large enterprise organizations, where you saw this horrific sort of bloat of technology and feature bloat and things that would just made things unusable. We've learned the lessons as an industry overall and I sold specifically we've always been focused on small to medium business so what we're doing is taking the best of that capability and delivering it in a way that we know small to medium business is capable of utilizing with, you know, one or two HR people the payroll person running out you know over here, somebody in finance trying to help out right that small team is capable of utilizing what it means is for small to medium business you've got an amazing sort of Renaissance of capabilities and new technologies available, easy to use that are just going to give you the same capacity to identify what people care about deliver the right benefits to your compensation. So, you know, in respect to the market overall, and make sure that you're able to hire and develop and retain the very best people. Jeff this has been fun. I hope we can do it again. It's been really great to talk to you. I appreciate it. I was talking about this stuff as you can probably tell and it's great to chat with you. My guest today has been Jeff Webb, the Vice President of Solutions Strategy at I solved. And this has been people tech, the podcast of the HCM technology report, where publication of recruiting daily. They're also a part of evergreen podcasts to see all of their programs, visit www.evergreenpodcast.com. And to keep up with HR technology. Visit the HCM technology report every day with the most trusted source of news in the HR tech industry. Find us at www.HCMtechnologyreport.com. And we'll see you next time. The questions to which we need answers. Join me every Friday to hear more."}, "podcast_summary": "In this podcast, Mark Pfeffer speaks with Jeff Webb, Vice President of Solutions Strategy at iSolve, about the new tools the company is incorporating into their PeopleCloud platform to help small and medium-sized businesses. They discuss the importance of embedding intelligence into HR tools to simplify workflows and make them easier to use. Webb explains that their approach involves utilizing artificial intelligence (AI) to identify trends, streamline work, and provide personalization and interaction capabilities. The goal is to make HR processes more efficient, improve decision-making, and enhance the employee experience. Additionally, they highlight the significance of ethics in AI and the need for transparency in the use of sensitive information. The conversation emphasizes how advancements in HR technology are benefiting small businesses by providing accessible and usable tools that were once only available to large enterprises.", "podcast_guest": {"name": "Jeff Webb", "org": "iSolve", "title": "", "summary": "Not Available"}, "podcast_highlights": "- Highlight 1 of the podcast: \"We're including a lot of capabilities and I hesitate to use the phrase artificial intelligence, but we are going to genuinely, it has its uses and we can certainly talk about what we mean by those things.\"\n- Highlight 2 of the podcast: \"There's a lot more intelligence in the platform and especially in the roadmap moving forward, we're continuing to develop intelligence in the platform for very good reasons, better analytics and just more capacity to automate and simplify the sort of the workflows.\"\n- Highlight 3 of the podcast: \"So I think if I think about the way that we are seeing the sort of the whole role of machine learning and artificial intelligence emerging in HR technology, I tend to think of it in sort of three buckets, three sort of groups of capabilities.\"\n- Highlight 4 of the podcast: \"The trick here is to embed them in a way that makes them not just useful but really, to a degree, almost built into the fabric of the workflow.\"\n- Highlight 5 of the podcast: \"And the good news is, you know, what we're seeing overall is in the industry is there is there's a good move to embedding more intelligence in these tools in a way that is easier to consume for people that just don't have the time to spend, you know, figuring out and tinkering under the hood.\""}